Tekla Open API Reference for Tekla Structures 2025
Solid.Intersect Method (LineSegment)
 Returns a list of line - solid intersection points.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList Intersect(
	LineSegment line
)
Public Function Intersect (
	line As LineSegment
) As ArrayList
Parameters
line
Type: Tekla.Structures.Geometry3d.LineSegment
The intersection line to be used.
Return Value
Type: ArrayList
A list of intersection points.
See Also
Reference
Solid Class
Intersect Overload
Tekla.Structures.Model Namespace